; domain
(define (domain AnimalJamDen)
  (:requirements :strips :typing)
  (:types entity attribute)
  
  (:predicates 
    (unacquired ?entity)
    (acquired ?entity)
    (in-store ?entity)
    (in-home ?entity)
    (unmade ?entity)
    (created ?entity)
    (safe ?entity)
  )
  
  (:action acquire-gems
    :parameters (?entity - entity)
    :precondition (unacquired ?entity)
    :effect (and (acquired ?entity) (not (unacquired ?entity)))
  )

  (:action bring-stuff-home
    :parameters (?entity - entity)
    :precondition (in-store ?entity)
    :effect (and (in-home ?entity) (not (in-store ?entity)))
  )

  (:action get-screens
    :parameters (?entity - entity)
    :precondition (in-store ?entity)
    :effect (and (in-home ?entity) (not (in-store ?entity)))
  )

  (:action create-rooms
    :parameters (?entity - entity)
    :precondition (unmade ?entity)
    :effect (and (created ?entity) (not (unmade ?entity)))
  )

  (:action make-outside-area
    :parameters (?entity - entity)
    :precondition (unmade ?entity)
    :effect (and (created ?entity) (not (unmade ?entity)))
  )

  (:action keep-family-safe
    :parameters (?entity - entity)
    :precondition ()
    :effect (safe ?entity)
  )
)

; problem
(define (problem MakeDenHome)
  (:domain AnimalJamDen)
  (:objects
    gems screens stuff kids-room outside-area - entity
  )
  (:init
    (unacquired gems)
    (in-store screens)
    (in-store stuff)
    (unmade kids-room)
    (unmade outside-area)
  )
  (:goal 
    (and 
      (acquired gems)
      (in-home screens)
      (in-home stuff)
      (created kids-room)
      (created outside-area)
      (safe kids-room) ; Assuming family is in the kids-room
    )
  )
)

; plan
1. (keep-family-safe kids-room)
   added: (safe kids-room)
   goals met: 1 of 6
2. (bring-stuff-home stuff)
   deleted: (in-store stuff)
   added: (in-home stuff)
   goals met: 2 of 6
3. (bring-stuff-home screens)
   deleted: (in-store screens)
   added: (in-home screens)
   goals met: 3 of 6
4. (create-rooms outside-area)
   deleted: (unmade outside-area)
   added: (created outside-area)
   goals met: 4 of 6
5. (create-rooms kids-room)
   deleted: (unmade kids-room)
   added: (created kids-room)
   goals met: 5 of 6
6. (acquire-gems gems)
   deleted: (unacquired gems)
   added: (acquired gems)
   goals met: 6 of 6
